#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
module.logs.aws_cloudwatch_log_group.minimal_lambda_function: Refreshing state... [id=/aws/lambda/minimal_lambda_function]
module.buckets.aws_s3_bucket_object.minimal_function_object: Refreshing state... [id=helloWorldHandler.zip]
module.policy.aws_iam_role.lambda_exec_role: Refreshing state... [id=lambda_exec]
module.network.aws_api_gateway_rest_api.api: Refreshing state... [id=eh5mzxa31b]
module.policy.aws_iam_policy.lambda_logging: Refreshing state... [id=arn:aws:iam::435552912911:policy/iam_policy_lambda_logging_function]
module.vpc.aws_vpc.kpinetworks_vpc: Refreshing state... [id=vpc-004b9544d0287a069]
module.network.aws_api_gateway_resource.resource: Refreshing state... [id=92o144]
module.network.aws_api_gateway_method.method: Refreshing state... [id=agm-eh5mzxa31b-92o144-GET]
module.policy.aws_lambda_permission.apigw_lambda: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.policy.aws_iam_role_policy_attachment.lambda_logs: Refreshing state... [id=lambda_exec-20210910222023809000000001]
module.functions.aws_lambda_function.minimal_lambda_function: Refreshing state... [id=minimal_lambda_function]
module.vpc.aws_subnet.private_subnet_a: Refreshing state... [id=subnet-06254fad976a8896b]
module.vpc.aws_subnet.private_subnet_b: Refreshing state... [id=subnet-050ac1709ec5cb3fc]
module.vpc.aws_security_group.kpinetworks_group: Refreshing state... [id=sg-079016f33dac97210]
module.network.aws_api_gateway_integration.integration: Refreshing state... [id=agi-eh5mzxa31b-92o144-GET]
module.network.aws_api_gateway_deployment.example: Refreshing state... [id=4m8lgd]
module.sql.aws_db_subnet_group.kpinetworks: Refreshing state... [id=kpinetworks]
module.network.aws_api_gateway_stage.example: Refreshing state... [id=ags-eh5mzxa31b-prod]
module.sql.aws_db_instance.kpinetworks_db: Refreshing state... [id=kpinetworksdb]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.buckets.data.aws_s3_bucket_object.db_sample_function_zip will be read during apply
  # (config refers to values not yet known)
 <= data "aws_s3_bucket_object" "db_sample_function_zip"  {
      + body                          = (known after apply)
      + bucket                        = "kpinetwork-backend"
      + bucket_key_enabled            = (known after apply)
      + cache_control                 = (known after apply)
      + content_disposition           = (known after apply)
      + content_encoding              = (known after apply)
      + content_language              = (known after apply)
      + content_length                = (known after apply)
      + content_type                  = (known after apply)
      + etag                          = (known after apply)
      + expiration                    = (known after apply)
      + expires                       = (known after apply)
      + id                            = (known after apply)
      + key                           = "dbSampleHandler.zip"
      + last_modified                 = (known after apply)
      + metadata                      = (known after apply)
      + object_lock_legal_hold_status = (known after apply)
      + object_lock_mode              = (known after apply)
      + object_lock_retain_until_date = (known after apply)
      + server_side_encryption        = (known after apply)
      + sse_kms_key_id                = (known after apply)
      + storage_class                 = (known after apply)
      + tags                          = (known after apply)
      + version_id                    = (known after apply)
      + website_redirect_location     = (known after apply)
    }

  # module.buckets.data.aws_s3_bucket_object.minimal_function_zip will be read during apply
  # (config refers to values not yet known)
 <= data "aws_s3_bucket_object" "minimal_function_zip"  {
      + body                          = (known after apply)
      ~ bucket_key_enabled            = false -> (known after apply)
      + cache_control                 = (known after apply)
      + content_disposition           = (known after apply)
      + content_encoding              = (known after apply)
      + content_language              = (known after apply)
      ~ content_length                = 620 -> (known after apply)
      ~ content_type                  = "binary/octet-stream" -> (known after apply)
      ~ etag                          = "752cccacd1bb8463c07c4b9b1f99aef1" -> (known after apply)
      + expiration                    = (known after apply)
      + expires                       = (known after apply)
      ~ id                            = "kpinetwork-backend/helloWorldHandler.zip" -> (known after apply)
      ~ last_modified                 = "Thu, 23 Sep 2021 16:33:51 UTC" -> (known after apply)
      ~ metadata                      = {} -> (known after apply)
      + object_lock_legal_hold_status = (known after apply)
      + object_lock_mode              = (known after apply)
      + object_lock_retain_until_date = (known after apply)
      + server_side_encryption        = (known after apply)
      + sse_kms_key_id                = (known after apply)
      ~ storage_class                 = "STANDARD" -> (known after apply)
      ~ tags                          = {} -> (known after apply)
      + version_id                    = (known after apply)
      + website_redirect_location     = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.db_sample_function_object will be created
  + resource "aws_s3_bucket_object" "db_sample_function_object" {
      + acl                    = "private"
      + bucket                 = "kpinetwork-backend"
      + bucket_key_enabled     = (known after apply)
      + content_type           = (known after apply)
      + etag                   = "6a96ee9bdf6efd40684397ab873b8807"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "dbSampleHandler.zip"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "buckets/../../dist/dbSampleHandler.zip"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.buckets.aws_s3_bucket_object.minimal_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "minimal_function_object" {
      ~ etag               = "752cccacd1bb8463c07c4b9b1f99aef1" -> "b7c2dcd02bf8e7a9ad6545b39f6524b1"
        id                 = "helloWorldHandler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.functions.aws_lambda_function.db_sample_lambda_function will be created
  + resource "aws_lambda_function" "db_sample_lambda_function" {
      + arn                            = (known after apply)
      + function_name                  = "db_sample_lambda_function"
      + handler                        = "dbSampleHandler.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = "arn:aws:iam::435552912911:role/lambda_exec"
      + runtime                        = "python3.8"
      + s3_bucket                      = "kpinetwork-backend"
      + s3_key                         = "dbSampleHandler.zip"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 3
      + version                        = (known after apply)

      + tracing_config {
          + mode = (known after apply)
        }

      + vpc_config {
          + security_group_ids = (known after apply)
          + subnet_ids         = (known after apply)
          + vpc_id             = (known after apply)
        }
    }

  # module.functions.aws_lambda_function.minimal_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "minimal_lambda_function" {
        id                             = "minimal_lambda_function"
      ~ last_modified                  = "2021-09-23T16:33:52.949+0000" -> (known after apply)
      ~ source_code_hash               = "Np8gkLrK7r+5Sei9kpOmRJT8KgeSHzH11mVuvAWNqcE=" -> (known after apply)
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.network.aws_eip.public_eip will be created
  + resource "aws_eip" "public_eip" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = (known after apply)
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Name" = "eip-kpinetworks"
        }
      + tags_all             = {
          + "Name" = "eip-kpinetworks"
        }
      + vpc                  = (known after apply)
    }

  # module.network.aws_internet_gateway.igw_kpinetworks will be created
  + resource "aws_internet_gateway" "igw_kpinetworks" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Name" = "igw-kpinetworks"
        }
      + tags_all = {
          + "Name" = "igw-kpinetworks"
        }
      + vpc_id   = "vpc-004b9544d0287a069"
    }

  # module.network.aws_nat_gateway.nat_kpinetworks will be created
  + resource "aws_nat_gateway" "nat_kpinetworks" {
      + allocation_id        = (known after apply)
      + connectivity_type    = "public"
      + id                   = (known after apply)
      + network_interface_id = (known after apply)
      + private_ip           = (known after apply)
      + public_ip            = (known after apply)
      + subnet_id            = (known after apply)
      + tags                 = {
          + "Name" = "nat-kpinetworks"
        }
      + tags_all             = {
          + "Name" = "nat-kpinetworks"
        }
    }

  # module.network.aws_route_table.kpinetworks_rt_private will be created
  + resource "aws_route_table" "kpinetworks_rt_private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = (known after apply)
              + instance_id                = ""
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = ""
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
      + tags_all         = (known after apply)
      + vpc_id           = "vpc-004b9544d0287a069"
    }

  # module.network.aws_route_table.kpinetworks_rt_public will be created
  + resource "aws_route_table" "kpinetworks_rt_public" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = (known after apply)
              + instance_id                = ""
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = ""
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
      + tags_all         = (known after apply)
      + vpc_id           = "vpc-004b9544d0287a069"
    }

  # module.network.aws_route_table_association.private_a_subnet will be created
  + resource "aws_route_table_association" "private_a_subnet" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = "subnet-06254fad976a8896b"
    }

  # module.network.aws_route_table_association.public_a_subnet will be created
  + resource "aws_route_table_association" "public_a_subnet" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_security_group.kpinetworks_group_lambda will be created
  + resource "aws_security_group" "kpinetworks_group_lambda" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "ALL"
              + from_port        = 0
              + ipv6_cidr_blocks = [
                  + "::/0",
                ]
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "kpinetwokrs_lambda_group"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "kpinetwokrs_lambda_group"
        }
      + tags_all               = {
          + "Name" = "kpinetwokrs_lambda_group"
        }
      + vpc_id                 = "vpc-004b9544d0287a069"
    }

  # module.vpc.aws_subnet.public_subnet_a will be created
  + resource "aws_subnet" "public_subnet_a" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "us-west-2a"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.0.3.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = true
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Name" = "public-subnet-us-west-2a"
        }
      + tags_all                        = {
          + "Name" = "public-subnet-us-west-2a"
        }
      + vpc_id                          = "vpc-004b9544d0287a069"
    }

Plan: 11 to add, 2 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @kellycastrof, Action: `pull_request`*